Repository: memocated/memocate-openedx-theme
Catalog: memocate.po
Languages: fi_fi

source: Remove bookmark
fi_fi: Poista kirjanmerkki

source: My Bookmarks
fi_fi: Kirjanmerkkini

source: Bookmarks
fi_fi: Kirjanmerkit

source: Boost the interaction skill of a
fi_fi: Vuorovaikutuskoulutus

source: Professional Caregiver
fi_fi: Am&shy;mat&shy;ti&shy;hoi&shy;ta&shy;jil&shy;le

source: At the moment we don't launch to individuals. Become a partner to get access for your caring organization.
fi_fi: Palvelu on tällä hetkellä saatavilla vain kumppaniorganisaatioille.

source: I'm a partner
fi_fi: Olen kumppani

source: Get in touch to became a partner
fi_fi: Haluan kumppaniksi

source: Become a more confident
fi_fi: Vuorovaikutuskoulutus

source: Family Caregiver
fi_fi: Omais&shy;hoi&shy;ta&shy;jil&shy;le

source: This course is currently in development. Want to get early access or learn more?
fi_fi: Kursseja kehitetään parhaillaan. Jos haluat pääsyn kurssille ensimmäisten joukossa

source: Contact us
fi_fi: Ota yhteyttä

source: Register
fi_fi: Rekisteröidy

source: Login
fi_fi: Kirjaudu sisään

source: © {org_name}. All rights reserved except where noted. EdX, Open edX and the edX and Open EdX logos are registered trademarks or trademarks of edX Inc.
fi_fi: © {org_name}. Kaikki oikeudet pidätetään, paitsi missä erikseen myönnetty. EdX, Open edX sekä edX ja Open EdX -logot ovat edX Inc:n rekisteröityjä tavaramerkkejä tai tavaramerkkejä.

source: Register Description
fi_fi: Rekisteriseloste

source: By registering, you agree to the
fi_fi: Rekisteröitymällä hyväksyt

source: Memocate Register Description
fi_fi: Memocaten rekisteriselosteen

source: Please wait
fi_fi: Ole hyvä ja odota

source: New to %(platformName)s?
fi_fi: Ensimmäistä kertaa täällä?

source: Register here
fi_fi: Rekisteröidy tästä

source: Your password
fi_fi: Valitse salasana

source: Your email
fi_fi: Sähköpostiosoitteesi

source: Your full name
fi_fi: Koko nimesi

source: Your user name (only letters, numbers, underscores, dashes)
fi_fi: Valitse käyttäjänimi (vain kirjaimia a-z, numeroita, alaviivoja ja yhdysmerkkejä)

source: Login here
fi_fi: Kirjaudu sisään

source: Already a member?
fi_fi: Oletko jo rekisteröitynyt?
